Tekla Open API Reference for Tekla Structures 2025
DatabaseObject.SetUserProperty Method (String, String)
 Sets a string property for the drawing object. The object has to be in a drawing before the method can be used.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetUserProperty(
	string Name,
	string Value
)
Public Function SetUserProperty (
	Name As String,
	Value As String
) As Boolean
Parameters
Name
Type: System.String
The name of the property to be set.
Value
Type: System.String
The new value for the property.
Return Value
Type: Boolean
True if the property was set successfully.
See Also
Reference
DatabaseObject Class
SetUserProperty Overload
Tekla.Structures.Drawing Namespace